#include<stdio.h>


int main()
{

	//=================P1:用if语句和goto语句构成一个循环======================

//	int i = 0;
//	int sum = 0;
//cnm: if (i <= 100)//***:即为循环的意思,其实是定义循环
//{
//	sum = sum + i;
//	i++;
//	printf("sum的值为 %d \n", sum);//只有当函数在goto之前才会被执行
//	goto cnm;//回到前面定义的循环 ***
//	// 随便定义一个量 然后打上： 后面带个goto ***即可形成循环 ,我随便打个cnm也可实现
//}
//printf("sum的值为%d \n", sum);//当printf写在if里面不会打印出来

	//==================P2:while语句 100以内求和=============================================
	//int i = 0;
	//int sum = 0;
	//while (i <= 100)
	//{
	//	sum = sum + i;
	//	i++;
	//}
	//printf(" sum 的值为%d \n", sum);

	//===================P3:使用do……while 100以内求和===================================================================

	//int i = 0;
	//int sum = 0;
	//do
	//{
	//	sum = sum + i;
	//	i++;
	//} while (i<=100);//先执行do语句后的 当while条件达成时候，执行后边语句

	//printf("sum的值为%d \n", sum);
	
	//==================P3:如果用for语句实现================================================
	//int sum = 0;
	//for (int i = 0; i <= 100; i++)
	//{
	//	sum = sum + i;
	//	printf("sum的值为%d \n", sum);//当printf在里面时候，会把每一次计算结果都打印出来
	//}

	/*int sum = 0;
	for (int i = 0; i <= 100; i++)
	{
		sum = sum + i;
	}
	printf("sum的值为%d \n", sum);*/


	//======================P4:break的食用方法====================================================
	int a = 10;
	while (a <= 15)
	{
		printf("a 的值为 %d \n", a);
		a++;
		if (a > 12)
		{
			break;
		}
	}


	return 0;
}