#include<stdio.h>	
#include<string>
int main(void)
{
	//二维数组里第一个框内是行，第二个框是列
	//int a[5][3] = 
	//{ 
	//	{80,80,80},
	//	{100,20,100},
	//	{300,100,20},//分段赋值
	//	{10,20,1},
	//	{10,100,21} 
	//};//五行三列
	// //如果只对部分元素赋值，则没有被赋值的元素自动取0

	////如果对全部元素赋初始值，则第一行的长度可以不给出
	//int b[][2] = { 2,3,4,5 };
	////对于二维数组，如a[3][4],可以理解为4个1维数组a[4]

	//char c[10];//定义字符数组
	////字符型数组和整形数组其实是通用的，也可以定义为int c[10],此时每个元素占两个字节单元

	//char d[4][6];//字符型数组也可以是多维的
	//char f[4] = { 'a','b','c','d' };
	//f[1]=a,f[2]=b,f[3]=c,f[4]=d
	//如果有元素没有被赋值，那么该元素就会被赋予0值

	//================实例练习一:字符数组练习======================================
	/*int i;
	int j;
	char a[2][5] = 
	{ 
		{'B','A','S','I','C'},
		{'d','B','A','S','E'}
	};
	for (i = 0; i <= 1; i++)
	{
		for (j = 0; j <= 4; j++)
		{
			printf("%c", a[i][j]);
		}
		printf("\n");
	}*/

	//C语言中没有专门的字符串变量
	//   \0通常作为字符串结束的标志,使用了\0那么就不需要通过字符数组长度来判断字符串的长度了
	//字符的标志用单引号'',字符串的标志用双引号""

    //==========================字符串================================
	//char c1[] = { "C program" };
	////也可以写为
	//char c2[] = "C program";


	//char c[] = "BASIC\ndBASE";
	//printf("%s\n", c);//%s后接c表示输出字符串c   
	//printf("%c\n", c[0]);//%c后接c表示输出c的地址,比如c[0]输出B,c[1]输出A
	////在这里c[0]是一个变量而c是一个指针


	//char st[15];
	//printf("input string:\n");
	//scanf_s("%s", st,15);//在VS中，要在st后写上限制的输入字数才可以运行，不然会崩溃
	//printf("%s\n", st);

	//在C语言中, puts(字符数组名),用于输出字符数组中的字符串
	/*char fc[] [5] =
	{
		{"CTM\n"},
		{"CNM"},
	};

	puts(fc[2]);

	char c[] = "\nWCSNDM\n";
	puts(c);*/


	//char st[15];
	//printf("input string \n");
	//gets_s(st);//gets_s获取字符串
	//puts(st);//puts输出字符串

	//================字符串连接函数strcat=================
	//格式：strcat(字符数组名1，字符数组名2)

	static char st1[30] = "My name is";
	char st2[10]; 
	printf("input your name:\n");
	gets_s(st2);
	strcat_s(st1, st2);//把st1和st2合并为一个字符串
	puts(st1);//这里输出的st1是和st2合并之后的


	return 0;
}